string[] textArray = {"В", "истории", "Анк-Морпорка", "крысы", "сыграли,", "немалую", "роль.", "Незадолго", "до", "прихода", 
"к", "власти", "патриция", "случилось", "ужасное", "нашествие", "крыс", "на", "город,", "и", "в", "качестве", "метода", "борьбы",
"городской", "совет", "предложил", "выплачивать", "по", "двадцать", "пенсов", "за", "каждый", "крысиный", "хвост.", "На", "неделю", "или", "две",
"количество", "крыс", "действительно", "снизилось,", "но", "потом", "люди", "с", "крысиными", "хвостами","стали","выстраиваться", "в", "огромные",
"очереди,", "городская", "казна", "опустела,", "а", "все", "только", "и", "делали,", "что", "гонялись", "за", "крысами.", "Которые", "по-прежнему",
"кишмя", "кишели", "повсюду.", "Лорд", "Витинари", "внимательно", "выслушал", "объяснение", "проблемы", "и", "решил", "её", "одной-единственной",
"памятной", "фразой,", "которая", "много", "говорила", "о", "нём", "самом,", "о", "глупости", "идеи", "с", "вознаграждением", "и", "о",
"врождённых", "инстинктах", "анк-морпоркцев.", "'Обложите", "налогом,", "крысиные", "фермы',", "сказал", "патриций"};
int count = 0;
int index = 0;
Console.Write(String.Join(" ", textArray));
Console.WriteLine();
Console.WriteLine("----------------------------------------------------------------------------------------------");
Console.WriteLine();
for (int i = 0; i < textArray.Length; i++)
{
    if(textArray[i].Length <= 3)
    {
        count++;
    }
}
string[] shortWordsArray = new string[count];
for(int i = 0; i < textArray.Length; i++)
{
    if(textArray[i].Length <= 3)
    {
        shortWordsArray[index] = textArray[i];
        index++;
    }
}
